var str = prompt('Что желаете выпить?')

switch (str) {
    case 'beer': alert('Чрезмерное употребление алкоголя вредит вашему здоровью и кошельку')
    break;
    case 'vodka': alert('Чрезмерное употребление алкоголя вредит вашему здоровью и кошельку')
    break;
    case 'coffee': alert('Чрезмерное употребление кофеина вредит вашему сердцу')
    break;
    case 'milk': alert('Поздравляем! Вы на правильном пути, на пути ЗОЖ!')
    break;
    default: alert('Призываем вести здоровый образ жизни и не вредить нашей планете')
}